---
kind: property
id: P:Autodesk.Revit.DB.Structure.Truss.TrussType
zh: 桁架
source: html/e5aac783-7724-bc13-3d49-002edf50ef66.htm
---
# Autodesk.Revit.DB.Structure.Truss.TrussType Property

**中文**: 桁架

Retrieve/set an object that represents the type of the truss.

## Syntax (C#)
```csharp
public TrussType TrussType { get; set; }
```